module Phonology
( consonant,
  vowel
) where

consonant = ["m","ɱ","n","ɳ","ɲ","ŋ","ɴ",
             "p","t","ʈ","c","k","q","ʔ",
             "b","d","ɖ","ɟ","g","ɢ",
             "ɓ","ɗ","ʄ","ɠ","ʛ",
             "ɸ","f","θ","s","ʃ","ʂ","ç","x","χ","ħ","h",
             "β","v","ð","z","ʒ","ʐ","ʝ","ɣ","ʁ","ʕ","ɦ",
             "ɬ","ɮ",
             "ʙ","r","ʀ",
             "ⱱ","ɾ","ɽ",
             "ʋ","ɹ","ɻ","j","ɰ",
             "w","ʍ","ɥ","ʜ","ʢ","ʡ","ɕ","ʑ","ɺ",
             "ɫ","l","ɭ","ʎ","ʟ"]
vowel = ["i","y","ɨ","ʉ","ɯ","u",
         "ɪ","ʏ","ʊ",
         "e","ø","ɘ","ɵ","ɤ","o",
         "ə","ɚ",
         "ɛ","œ","ɜ","ɞ","ʌ","ɔ",
         "æ","ɐ",
         "a","ɶ","ɑ","ɒ"]
